export default async function before(m, { conn , bot }) {
  const triggers = {
    "السلام عليكم": ["*وعليكم السلام منور يغالي 🤎*", "*وعليكم السلام ورحمة الله وبركاته ❤️*"],
    "تست": ["تست", "تست تست", "أي موجود", "شغال", "اي وش تريد؟", "خلاص!!", "هااا"],
    "احبك": ["حبيبي 💜", " حبيبي انت"],
    "نورك": ["نورك الأصل"],
    "بنورك": ["نورك الأصل"],
    "غوكو": ["نعم", "عيون غوكو😍", "معاك", "أأمرني", "أطلب", "تفضل"],
    "يا غوكو": ["نعم", "عيون غوكو😍", "معاك", "أأمرني", "أطلب", "تفضل"],
    "بوت": ["عندي إسم 😒", "إسمي غوكو، غوكوو!", "غوكو لو سمحت", "بالله لا تعيدها", "خلاص زعلت💔"],
    "يا بوت": ["عندي إسم 😒", "إسمي غوكو، غوكوو!", "غوكو لو سمحت", "بالله لا تعيدها", "خلاص زعلت💔"],
    "البوت": ["عندي إسم 😒", "إسمي غوكو، غوكوو!", "غوكو لو سمحت", "بالله لا تعيدها", "خلاص زعلت💔"],
    "دز": ["شكراً", "مشكور 😭", "يلا باي"],
    "هلا": ["*هلا وغلا*", "*هلا بيك*", "*يا هلا*"],
    "باي": ["*مع السلامة👋*", "*باي باي👋*", "*الله معاك*"],
    "صباح الخير": ["*صباح النور🌟*", "*صباح الورد💐*", "*صباح الفل🌸*"],
    "مساء الخير": ["*مساء النور*", "*مساء الورد💐*", "*مساء الفل🌸*", "*مساء الجوري🌺*"],
    "مساء النور": ["*مساء الورد💐*", "*مساء الفل🌸*", "*الله نورك*"]
  };

  const replies = triggers[m.text];
  if (replies) {
    const ranReply = replies[Math.floor(Math.random() * replies.length)];
    m.reply(ranReply);
  }
  
  return false;
}
