const sections = async (m, { conn, args }) => {

const section = args[0];

// ===== قسم التحميل =====
if (section === "downloads") {

const text = `
╭━━━━━━━━━━━━━━━╮
┃ 📂 *قسم التحميل*
╰━━━━━━━━━━━━━━━╯

➤ .انستا
➤ .فيس
➤ .ميديافاير
➤ .تيك
➤ .بينترست
➤ .اغنيه
➤ .فيديو
➤ .يوتيوب

━━━━━━━━━━━━━━━

📌 *وصف سريع:*
تحميل من مختلف المنصات مثل:
يوتيوب • تيك توك • انستغرام • فيسبوك • ميديافاير

━━━━━━━━━━━━━━━

> *رَبَّنَا اغفِر لَنا وَلِإِخوانِنَا الَّذينَ سَبَقونا بِالإيمانِ وَلا تَجعَل في قُلوبِنا غِلًّا لِلَّذينَ آمَنوا رَبَّنا إِنَّكَ رَءوفٌ رَحيمٌ*


> *╭─┈─┈─⟞🐉⟝─┈─┈─╮*
> *┃ 𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
> *╰─┈─┈─⟞🐉⟝─┈─┈─╯*
`.trim();

return conn.sendMessage(m.chat, { text });

}

};

export default sections;
