 const sections = async (m, { conn, args }) => {

const section = args[0];

// ===== 1 - التحميل =====
if (section === "downloads") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 📂 *قسم التحميل*
╰━━━━━━━━━━━━━━━╯

➤ .انستا
➤ .فيس
➤ .ميديافاير
➤ .تيك
➤ .اغنية
➤ .فيديو
➤ .بينترست
➤ .يوتيوب

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 2 - المجموعات =====
if (section === "group") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 👥 *قسم المجموعات*
╰━━━━━━━━━━━━━━━╯

➤ .رابط
➤ .
➤ .
➤ .

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 3 - الملصقات =====
if (section === "sticker") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 💌 *قسم الملصقات*
╰━━━━━━━━━━━━━━━╯

➤ .ملصق
➤ .حقوق

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 4 - المطورين =====
if (section === "owner") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 👨‍💻 *قسم المطورين*
╰━━━━━━━━━━━━━━━╯

➤ .ارفعني
➤ .إضافة-مطور
➤ .اذاعه
➤ .حظر
➤ .فك_حظر
➤ .اضافه_ملف
➤ .حذف_ملف
➤ .انضم
➤ .اخرج
➤ .رستارت
➤ .ايقاف

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 5 - الأدمن =====
if (section === "admin") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 👨🏻‍⚖️ *قسم الأدمن*
╰━━━━━━━━━━━━━━━╯

➤ .ضيف
➤ .طرد
➤ .رفع
➤ .خفض
➤ .قفل
➤ .فتح
➤ .حذف
➤ .مخفي
➤ .تسجيل
➤ .منشن
➤ .كتم
➤ .فك_كتم
➤ .الطلبات
➤ .اقبل_الطلبات
➤ .تفعيل
➤ .انذار
➤ .انذاراتي

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 6 - الألعاب =====
if (section === "games") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 🎮 *قسم الألعاب*
╰━━━━━━━━━━━━━━━╯

➤ .تفكيك
➤ .علم
➤ .عين

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 7 - الصور =====
if (section === "pictures") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 🖼 *قسم الصور*
╰━━━━━━━━━━━━━━━╯

➤ .بنترست
➤ .تعديل
➤ .لرابط
➤ .نسخ
➤ .لجيف
➤ .لصوره
➤ .لصوت
➤ .لفيديو

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 8 - البنك =====
if (section === "bank") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 💰 *قسم البنك*
╰━━━━━━━━━━━━━━━╯

➤ .رصيد
➤ .تحويل
➤ .شراء

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 9 - البوت الفرعي =====
if (section === "sub") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 📲 *قسم البوت الفرعي*
╰━━━━━━━━━━━━━━━╯

➤ .اذاعة_فرعي
➤ .تنصيب
➤ .البوتات
➤ .حذف_بوت
➤ .احصائيات_البوتات

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

// ===== 10 - معلومات البوت =====
if (section === "info") {
    await sendSection(m, conn, `
╭━━━━━━━━━━━━━━━╮
┃ 📑 *معلومات البوت*
╰━━━━━━━━━━━━━━━╯

➤ .معلومات
➤ .ping 【.بنج】

━━━━━━━━━━━━━━━
> *𝐆𝐎𝐊𝐔 𝐁𝐎𝐓🐉🤖*
`);
}

};

// ===== دالة الإرسال + حذف رسالة القائمة =====
async function sendSection(m, conn, text) {
    await conn.sendMessage(m.chat, {
        delete: {
            remoteJid: m.chat,
            id: m.quoted.id,
            fromMe: true
        }
    });

    await conn.sendMessage(m.chat, { text });
}

export default sections;
